IRP/src/InformationRegisters/ExternalCommands/ExternalCommands.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>ExternalCommands</name>
 <attributes>
  <name>InterfaceGroup</name>
  <type>
   <types>CatalogRef.InterfaceGroups</types>
  </type>
 </attributes>
 <dimensions>
  <name>ConfigurationMetadata</name>
  <type>
   <types>CatalogRef.ConfigurationMetadata</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ExternalDataProc</name>
  <type>
   <types>CatalogRef.ExternalDataProc</types>
  </type>
 </dimensions>
 <dimensions>
  <name>FormType</name>
  <type>
   <types>EnumRef.FormTypes</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/ConfigurationMetadata/ConfigurationMetadata.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ConfigurationMetadata</name>
 <hierarchical>true</hierarchical>
 <hierarchyType>HierarchyOfItems</hierarchyType>
 <predefined>
  <items>
   <name>Catalogs</name>
   <description>Catalogs</description>
  </items>
  <items>
   <name>Documents</name>
   <description>Documents</description>
  </items>
  <items>
   <name>Reports</name>
   <description>Reports</description>
  </items>
  <items>
   <name>DataProcessors</name>
   <description>Data processors</description>
  </items>
 </predefined>
 <attributes>
  <name>Extension</name>
  <type>
   <types>CatalogRef.Extensions</types>
  </type>
 </attributes>
 <attributes>
  <name>CheckDescriptionDuplicate</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CheckDescriptionFilling</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ObjectName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>64</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ObjectFullName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>128</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Unused</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ELedgerShortDescription</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ELedgerLongDescription</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>ImportantAttributes</name>
  <attributes>
   <name>TabularName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>AttributeName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>NotAuditAttributes</name>
  <attributes>
   <name>TabularName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>AttributeName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ReadOnlyAttributes</name>
  <attributes>
   <name>TabularName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>AttributeName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>HiddenAttributes</name>
  <attributes>
   <name>TabularName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>AttributeName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ExternalDataProc/ExternalDataProc.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ExternalDataProc</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Settings</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>PathToExtDataProcForTest</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DataProcStorage</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>UnsafeMode</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/ExternalCommandsServer/Module.bsl
Procedure CreateCommands(Form, ObjectName, ObjectType, FormType, AddInfo = Undefined) Export	
	
	Query = New Query;
	Query.Text = "SELECT
	|	ExternalCommands.ExternalDataProc,
	|	ExternalCommands.InterfaceGroup
	|FROM
	|	InformationRegister.ExternalCommands AS ExternalCommands
	|WHERE
	|	ExternalCommands.ConfigurationMetadata = &ConfigurationMetadata
	|	AND (ExternalCommands.FormType = &FormType
	|	OR ExternalCommands.FormType = VALUE(Enum.FormTypes.EmptyRef))";
	ConfigurationMetadata = Catalogs.ConfigurationMetadata.FindByDescription(ObjectName, True, ObjectType);
	Query.SetParameter("ConfigurationMetadata", ConfigurationMetadata);
	Query.SetParameter("FormType", FormType);
	QueryExecution = Query.Execute();
	
	If QueryExecution.IsEmpty() Then
		Return;
	EndIf;
	
	CommandGroupParent = Form.CommandBar;
	
	QuerySelection = QueryExecution.Select();
	While QuerySelection.Next() Do
		
		ExternalDataProc = QuerySelection.ExternalDataProc;
		
		CommandInfo = FormItemInfo(ExternalDataProc);
		CommandForm = Form.Commands.Add(CommandInfo.Name);
		CommandForm.Title = CommandInfo.Title;
		CommandForm.Action = "GeneratedFormCommandActionByName";
		
		If ValueIsFilled(QuerySelection.InterfaceGroup) Then
			GroupInfo = FormItemInfo(QuerySelection.InterfaceGroup);
			FoundedGroup = Form.CommandBar.ChildItems.Find(GroupInfo.Name);
			If FoundedGroup = Undefined Then
				FoundedGroup = Form.Items.Add(GroupInfo.Name, Type("FormGroup"), CommandGroupParent);
				FoundedGroup.Type = FormGroupType.Popup;
				FoundedGroup.Title = GroupInfo.Title;
			EndIf;
			CommandParent = FoundedGroup;
		Else
			CommandParent = CommandGroupParent;
		EndIf;
		
		CommandButton = Form.Items.Add(CommandForm.Name, Type("FormButton"), CommandParent);
		CommandButton.CommandName = CommandForm.Name;
		
	EndDo;
	
EndProcedure

Function FormItemInfo(ItemRef)
	Result = New Structure();
	Name = "_" + StrReplace(ItemRef.UUID(), "-", "_");
	Result.Insert("Name", Name);
	Result.Insert("Title", String(ItemRef));
	Return Result;
EndFunction

Procedure GeneratedFormCommandActionByName(Object, Form, CommandName, AddInfo = Undefined) Export	
	ExtProc = GetRefOfExternalDataProcByName(CommandName);	
	Info = AddDataProcServer.AddDataProcInfo(ExtProc);
	Info.Create = True;
	AddDataProc = AddDataProcServer.CallMethodAddDataProc(Info);
	If Not AddDataProc = Undefined Then
		AddDataProc.CommandProcedure(Object, Form);
	EndIf;
EndProcedure

Procedure GeneratedListChoiceFormCommandActionByName(SelectedRows, Form, CommandName, AddInfo = Undefined) Export	
	ExtProc = GetRefOfExternalDataProcByName(CommandName);	
	Info = AddDataProcServer.AddDataProcInfo(ExtProc);
	Info.Create = True;
	AddDataProc = AddDataProcServer.CallMethodAddDataProc(Info);
	If Not AddDataProc = Undefined Then
		AddDataProc.CommandProcedure(SelectedRows, Form);	
	EndIf;
EndProcedure

Function GetRefOfExternalDataProcByName(CommandName) Export
	
	UUIDRow = Mid(StrReplace(CommandName, "_", "-"), 2, 36);
	UUIDCat = New UUID(UUIDRow);
	ExtProc = Catalogs.ExternalDataProc.GetRef(UUIDCat);
	
	Return ExtProc;
	
EndFunction
